{
	"skills": [{
		"id": "ue4",
		"title": "Unreal Engine 4 Development",
		"order": "1",
		"details": "<p>&#8220;<span style='font-style:italic'>Unreal Engine 4 is a suite of integrated tools for game developers to design and build games, simulations, and visualizations.</span>&#8221; - <a href='https://www.unrealengine.com' target='_blank'>unrealengine.com</a></p><p>Unreal Engine is an incredible resource for game and simulation development, enabling cross discipline collaboration in an intuitive environment.</p><p>Below are a few of the systems I have work on in various projects, include the development of the upcoming game <a href='https://www.eidetus.com/' target='_blank'>Eidetus</a>:</p><ul><li>Replicating values and methods between servers and clients</li><li>Handling large datasets with associated actor creation</li><li>Implementing menu and frequently updated interfaces in UMG</li><li>Streaming and unstreaming multiple levels into the same scene</li><li>Handling parameter-based particle systems</li><li>Optimizing character animations of differing priorities</li></ul>"
	}, {
		"id": "asana",
		"title": "Asana Project Management",
		"order": "2",
		"details": "<p>&#8220;<span style='font-style:italic'>Asana helps you coordinate all the work your team does together. So everyone knows what needs to get done, who's responsible for doing it, and when it's due.</span>&#8221; - <a href='https://asana.com/' target='_blank'>asana.com</a></p><p>Some responsibilities I have handled with Asana are as follows:</p><ul><li>Organized tasks into weekly releases, dot versioning, and consecutive sprints in an Agile workflow</li><li>Tracking progress of overall project and active sprints</li><li>Providing granular subtasks for larger feature sets that may have multiple assignees and due dates</li><li>Providing clear reproduction steps for issues of varying priority and severity</li></ul>"
	}, {
		"id": "gulp",
		"title": "Gulp Workflow",
		"order": "3",
		"details": "<p>&#8220;<span style='font-style:italic'>gulp is a toolkit for automating painful or time-consuming tasks in your development workflow, so you can stop messing around and build something.</span>&#8221; - <a href='https://gulpjs.com/' target='_blank'>gulpjs.com</a></p><p>Using a gulp workflow, one can quickly automate a number of tasks into an efficient pipeline.</p><p>Below are a few tasks that I have used in the past:</p><ul><li>Compiled SCSS into CSS with prefixes for all relevant browsers with optional sourcemaps or minification</li><li>Compiled Nunjucks, the templating preprocessor for HTML, while retrieving a number of JSON files for generating markup via data iteration</li><li>Handled JavaScript linting and error detection without breaking the build pipeline</li><li>Provided a live local server for testing development across multiple browsers and devices on the network</li><li>Monitored changes in development directories for all relevant files to immediately re-execute applicable tasks</li></ul><p>In addition, through simple CLI commands an entire project can be up-and-running after downloading the repository from a git hosting platform.</p>"
	}, {
		"id": "vue",
		"title": "Vue JS Framework",
		"order": "4",
		"details": "<p>&#8220;<span style='font-style:italic'>An incrementally adoptable ecosystem that scales between a library and a full-featured framework.</span>&#8221; - <a href='https://vuejs.org/' target='_blank'>vuejs.org</a></p><p>Vue portfolio items coming soon!</p>"
	}]
}
